import React, { useState, useRef } from 'react';
import { Overlay} from 'react-bootstrap';
import './Catalog.scss';
import CatalogItem from './CatalogItem';

export default function Catalog() {
  const [show, setShow] = useState(false);
  const target = useRef(null);

  return (
    <>
      <button ref={target} onClick={() => setShow(!show)}>
        <img src="/images/icons/menu.svg" />
        <p>Каталог товаров</p>
      </button>
      <Overlay target={target.current} show={show} placement="bottom">
        {({ placement, arrowProps, show: _show, popper, ...props }) => (
          <div
            className="catalog"
            {...props}
          >
                <CatalogItem title="Ноутбуки та комп'ютери" subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]} /> 
                <CatalogItem title="Смартфони, годинники"  subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]} />
                <CatalogItem title="Товари для геймерів"  subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]} />
                <CatalogItem title="Побутова техніка"  subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]} />
                <CatalogItem title="Техніка для кухні" subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]}  />
                <CatalogItem title="Техніка для саду та городу" subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]}  />
                <CatalogItem title="Автотовари та запчастини"  subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]} />
                <CatalogItem title="Краса та здоров’я"  subcategories={[{'Ноутбуки': ['Asus', 'Lenovo', 'Dell', 'HP', 'Apple Macbook']}, {'Компютери': ['Манітори', 'Клавіатури', 'Мишки', 'Компютерні колонки', 'Програмне забезпечення']}, {'Планшети': ['Samsung', 'Apple iPad', 'HP', 'Xiaomi', 'Lenovo', 'Плівки, скло', 'Захисні чохли']}, {'Офісна техніка': ['Принтери', 'Сканери', 'Телефони']}, {'Аксесуари для ноутбуків': ['Навушники', 'Камера', 'Мікрофон', 'Карти памяті', 'Підставки для ноутбука', 'Переносні сумки', 'Захисні чохли']}]} />
          </div>
        )}
      </Overlay>
    </>
  );
}
